* Template
|----------------------------+-------+--------+-------+-----------|
| Configuration              | First | Second | Third | Average   |
|----------------------------+-------+--------+-------+-----------|
| Example with one train     |       |        |       | vmean([]) |
| Example with two trains    |       |        |       | vmean([]) |
| Shared Segment             |       |        |       | vmean([]) |
| Large Network              |       |        |       | vmean([]) |
| Station One                |       |        |       | vmean([]) |
| Station Two                |       |        |       | vmean([]) |
| Station Four               |       |        |       | vmean([]) |
| Station Six                |       |        |       | vmean([]) |
| Station Eight              |       |        |       | vmean([]) |
| Station Ten                |       |        |       | vmean([]) |
| Station Twelfth            |       |        |       | vmean([]) |
| Two trains same direction  |       |        |       | vmean([]) |
| Four trains same direction |       |        |       | vmean([]) |
| Nærumbanen (2T)            |       |        |       | vmean([]) |
|----------------------------+-------+--------+-------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Move between segments)
** Elapsed time
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third | Average   |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    0.009 |    0.008 |    0.009 | vmean([]) |
| Example with two trains    |    0.056 |    0.069 |    0.068 | vmean([]) |
| Shared Segment             |    0.033 |    0.040 |    0.041 | vmean([]) |
| Large Network              |    0.022 |    0.031 |    0.047 | vmean([]) |
| Station One                |    0.032 |    0.037 |    0.038 | vmean([]) |
| Station Two                |    0.316 |    0.404 |    0.374 | vmean([]) |
| Station Four               |   12.138 |   11.746 |   11.241 | vmean([]) |
| Station Six                |  254.857 |  253.484 |  255.691 | vmean([]) |
| Station Eight              | 1658.055 | 1580.792 | 1545.470 | vmean([]) |
| Station Ten                | 6293.598 | 6145.904 | 6052.362 | vmean([]) |
| Station Twelfth            |          |          |          | vmean([]) |
| Two trains same direction  |          |          |          | vmean([]) |
| Four trains same direction |          |          |          | vmean([]) |
| Nærumbanen (2T)            |          |          |          | vmean([]) |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third | Average   |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    9.296 |    9.320 |    9.324 | vmean([]) |
| Example with two trains    |   10.116 |   10.132 |   10.144 | vmean([]) |
| Shared Segment             |   11.644 |   11.936 |   12.212 | vmean([]) |
| Large Network              |   13.876 |   13.924 |   13.940 | vmean([]) |
| Station One                |   10.052 |   10.068 |   10.080 | vmean([]) |
| Station Two                |   16.324 |   16.388 |   16.396 | vmean([]) |
| Station Four               |   59.620 |   59.884 |   59.900 | vmean([]) |
| Station Six                |  211.792 |  212.548 |  212.528 | vmean([]) |
| Station Eight              |  540.852 |  542.156 |  542.156 | vmean([]) |
| Station Ten                | 1177.352 | 1177.396 | 1179.200 | vmean([]) |
| Station Twelfth            |          |          |          | vmean([]) |
| Two trains same direction  |          |          |          | vmean([]) |
| Four trains same direction |          |          |          | vmean([]) |
| Nærumbanen (2T)            |          |          |          | vmean([]) |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Critical section)
** Elapsed time
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third | Average   |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    0.003 |    0.006 |    0.007 | vmean([]) |
| Example with two trains    |    0.061 |    0.052 |    0.067 | vmean([]) |
| Shared Segment             |    0.031 |    0.031 |    0.052 | vmean([]) |
| Large Network              |    0.029 |    0.032 |    0.034 | vmean([]) |
| Station One                |    0.030 |    0.016 |    0.021 | vmean([]) |
| Station Two                |    0.351 |    0.402 |    0.350 | vmean([]) |
| Station Four               |   11.451 |   11.260 |   10.112 | vmean([]) |
| Station Six                |  257.545 |  239.275 |  240.982 | vmean([]) |
| Station Eight              | 1757.166 | 1660.574 | 1666.525 | vmean([]) |
| Station Ten                | 6251.048 | 6112.542 |          | vmean([]) |
| Station Twelfth            |          |          |          | vmean([]) |
| Two trains same direction  |          |          |          | vmean([]) |
| Four trains same direction |          |          |          | vmean([]) |
| Nærumbanen (2T)            |          |          |          | vmean([]) |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+----------+-----------+---------+-----------|
| Configuration              |    First |    Second |   Third | Average   |
|----------------------------+----------+-----------+---------+-----------|
| Example with one train     |    7.656 |     7.668 |   7.672 | vmean([]) |
| Example with two trains    |   10.448 |    10.472 |  10.480 | vmean([]) |
| Shared Segment             |    9.948 |     9.976 |   9.980 | vmean([]) |
| Large Network              |   11.948 |    11.996 |  12.008 | vmean([]) |
| Station One                |    8.396 |     8.424 |   8.428 | vmean([]) |
| Station Two                |   15.408 |    15.456 |  15.464 | vmean([]) |
| Station Four               |   58.064 |    58.308 |  58.316 | vmean([]) |
| Station Six                |  208.876 |   209.304 | 209.308 | vmean([]) |
| Station Eight              |  542.196 |   543.516 | 543.516 | vmean([]) |
| Station Ten                | 1178.508 | 117x8.568 |         | vmean([]) |
| Station Twelfth            |          |           |         | vmean([]) |
| Two trains same direction  |          |           |         | vmean([]) |
| Four trains same direction |          |           |         | vmean([]) |
| Nærumbanen (2T)            |          |           |         | vmean([]) |
|----------------------------+----------+-----------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No collision
** Elapsed time
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third | Average   |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    0.006 |    0.006 |    0.007 | vmean([]) |
| Example with two trains    |    0.034 |    0.035 |    0.063 | vmean([]) |
| Shared Segment             |    0.018 |    0.037 |    0.033 | vmean([]) |
| Large Network              |    0.024 |    0.029 |    0.040 | vmean([]) |
| Station One                |    0.018 |    0.017 |    0.019 | vmean([]) |
| Station Two                |    0.306 |    0.398 |    0.349 | vmean([]) |
| Station Four               |   12.486 |   10.081 |   12.083 | vmean([]) |
| Station Six                |  252.827 |  246.848 |  249.513 | vmean([]) |
| Station Eight              | 1625.016 | 1620.067 | 1548.218 | vmean([]) |
| Station Ten                |          |          |          | vmean([]) |
| Station Twelfth            |          |          |          | vmean([]) |
| Two trains same direction  |          |          |          | vmean([]) |
| Four trains same direction |          |          |          | vmean([]) |
| Nærumbanen (2T)            |          |          |          | vmean([]) |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third | Average   |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   7.648 |   7.660 |   7.660 | vmean([]) |
| Example with two trains    |   8.420 |   8.428 |   8.436 | vmean([]) |
| Shared Segment             |   9.924 |   9.956 |  10.216 | vmean([]) |
| Large Network              |  11.948 |  12.000 |  12.008 | vmean([]) |
| Station One                |   8.404 |   8.412 |   8.420 | vmean([]) |
| Station Two                |  14.920 |  14.976 |  14.984 | vmean([]) |
| Station Four               |  58.036 |  58.280 |  58.288 | vmean([]) |
| Station Six                | 209.552 | 210.308 | 210.312 | vmean([]) |
| Station Eight              | 543.948 | 544.996 | 545.256 | vmean([]) |
| Station Ten                |         |         |         | vmean([]) |
| Station Twelfth            |         |         |         | vmean([]) |
| Two trains same direction  |         |         |         | vmean([]) |
| Four trains same direction |         |         |         | vmean([]) |
| Nærumbanen (2T)            |         |         |         | vmean([]) |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* Will arrive
** Elapsed time
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third | Average   |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    0.007 |    0.005 |    0.005 | vmean([]) |
| Example with two trains    |    0.063 |    0.054 |    0.063 | vmean([]) |
| Shared Segment             |    0.018 |    0.017 |    0.020 | vmean([]) |
| Large Network              |    0.023 |    0.042 |    0.038 | vmean([]) |
| Station One                |    0.018 |    0.029 |    0.030 | vmean([]) |
| Station Two                |    0.300 |    0.318 |    0.401 | vmean([]) |
| Station Four               |   12.274 |   10.647 |   12.419 | vmean([]) |
| Station Six                |  259.847 |  261.048 |  261.756 | vmean([]) |
| Station Eight              | 1670.962 | 1697.476 | 1604.006 | vmean([]) |
| Station Ten                |          |          |          | vmean([]) |
| Station Twelfth            |          |          |          | vmean([]) |
| Two trains same direction  |          |          |          | vmean([]) |
| Four trains same direction |          |          |          | vmean([]) |
| Nærumbanen (2T)            |          |          |          | vmean([]) |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third | Average   |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   7.584 |   7.592 |   7.592 | vmean([]) |
| Example with two trains    |   8.348 |   8.348 |   8.348 | vmean([]) |
| Shared Segment             |   9.860 |   9.880 |   9.884 | vmean([]) |
| Large Network              |  11.860 |  11.900 |  11.904 | vmean([]) |
| Station One                |   8.332 |   8.332 |   8.332 | vmean([]) |
| Station Two                |  15.332 |  15.376 |  15.384 | vmean([]) |
| Station Four               |  58.804 |  58.980 |  58.996 | vmean([]) |
| Station Six                | 205.536 | 205.880 | 205.900 | vmean([]) |
| Station Eight              | 542.224 | 543.556 | 543.556 | vmean([]) |
| Station Ten                |         |         |         | vmean([]) |
| Station Twelfth            |         |         |         | vmean([]) |
| Two trains same direction  |         |         |         | vmean([]) |
| Four trains same direction |         |         |         | vmean([]) |
| Nærumbanen (2T)            |         |         |         | vmean([]) |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)
